Revit 2026 API

# PointCloudTypeEngineIdentifier Property

---

The identifier of the engine responsible for handling of the point cloud.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string EngineIdentifier { get; }
```
```vb
Public ReadOnly Property EngineIdentifier As String
	Get
```
```cpp
public:
property String^ EngineIdentifier {
	String^ get ();
}
```
```fsharp
member EngineIdentifier : string with get
```

#### Property Value

String

The built-in engine provides "rcs" and "rcp" here.

#### Reference

PointCloudType Class

Autodesk.Revit.DB Namespace